import { Network } from "../environment/Network";
import { Log } from "../helper/Log";
import { Setup } from "./Setup";

export class Simulation {

    public run(): void {

        const setup = new Setup();
        let currentTime: number = 0;
        /* delay de cada ticke 
        que repsenta un día
        */

        try {
            /** ********************************************************* */
            /**                   CONFIGURACIÓN GLOBAL                   */
            /** ********************************************************* */

            setup.global();

            for (let iteration = 1; iteration < 100; iteration++) {


                currentTime = 0;

                /** ********************************************************* */
                /**                   CONFIGURACIÓN LOCAL                   */
                /** ********************************************************* */

                const args = setup.local();
                const network = new Network(args);

                /** ********************************************************* */
                /**                INICIALIZACIÓN DE AGENTES                  */
                /** ********************************************************* */

                network.createAgents();

                /** ********************************************************* */
                /**                   CREACIÓN DE LA RED                      */
                /** ********************************************************* */

                network.createNetwork();

                /** ******************************************************************* */
                /**                          SIMULAR TRANSACCIONES                      */
                /** ******************************************************************* */

                for (let tick = 1; tick < 100; tick++) {


                    currentTime = tick

                    /** ************************************************************** */
                    /**    OPERACION: DEPOSIT    */
                    /** ************************************************************** */

                    network.createDepositOperacion(currentTime);

                    /** ************************************************************** */
                    /**           OPERACION: TRANSFER, WITHDRAWAL             */
                    /** ************************************************************** */
                    network.createTransferOperation(currentTime);

                    /** ************************************************************** */
                    /**           OPERACION: TRANSFER, WITHDRAWAL             */
                    /** ************************************************************** */
                    network.createWithdrawalOperation(currentTime);
                }


                /** ********************************************************* */
                /**                   CONFIGURACIÓN INICIAL                   */
                /** ********************************************************* */


                /** ********************************************************* */
                /**                   CONFIGURACIÓN INICIAL                   */
                /** ********************************************************* */

                /** ********************************************************* */
                /**                   CONFIGURACIÓN INICIAL                   */
                /** ********************************************************* */

                /** ********************************************************* */
                /**                   CONFIGURACIÓN INICIAL                   */
                /** ********************************************************* */
            }

        } catch (error) {
            Log.fatal(error);
        }
    }
}